---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShorterThanMinWallError
source: html/732ad09a-190b-a450-2827-f62c000a8438.htm
---
# Autodesk.Revit.DB.BuiltInFailures.WallFailures.ShorterThanMinWallError Property

Wall is shorter than minimum height allowed by its type.\nIt is [Length] and must be at least [Length].

## Syntax (C#)
```csharp
public static FailureDefinitionId ShorterThanMinWallError { get; }
```